morze = {'a': '•—', 'b': '—•••', 'c': '—•—•', 'd': '—••',
         'e': '•', 'f': '••—•', 'g': '——•', 'h': '••••',
         'i': '••', 'j': '•———', 'k': '—•—', 'l': '•—••',
         'm': '——', 'n': '—•', 'o': '———', 'p': '•——•',
         'q': '——•—', 'r': '•—•', 's': '•••', 't': '—',
         'u': '••—', 'v': '•••—', 'w': '•——', 'x': '—••—',
         'y': '—•——', 'z': '——••'}

# На вводе .lower().split()
#
# потом 2 цикла (по словам потом по буквам)
#
# и print обращаемся к словарю через get
#
# и еще один пустой print() чтобы с новой строки выводил. ВСЕ!!!

# s = input()
for i in morze:
#     if morze[i] in s:
#         print(morze[i], end=" ")
#     else:
#         print()

    print(morze[i])



s = input().lower()
for i in s:
    for j in i:
        if j in morze:
            print(morze[i], end=' ')
        else:
            print()













